<?php
$recipes = array(
    array(
        'id' => 1,
        'title' => "Чізкейк",
        'ingredients' => " Вівсяне печиво 300 г Сир «Філадельфія» або інший вершковий сир 650 г Масло вершкове 160 г + для змащування форми Пудра цукрова 100 г Яйця 3 шт. Вершки (не менше 20% жирності) Ванілін або ванільний цукор",
        'content' => "1. Зробити основу для чізкейку. Для цього печиво вівсяне необхідно ретельно подрібнити за допомогою блендера. Перекласти в миску. 2. Вершкове масло розтопити і перемішати з подрібненим печивом. 3. Сир «Філадельфія» і цукрову пудру збити міксером до однорідного стану протягом декількох хвилин. 4. У збитий сир додати поступово яйця, потім вершки і ванілін або ванільний цукор. Всі разом ще раз збити. 5. Вершковим розм'якшеним маслом змастити дно і стінки форми. Вирізати широкі смужки зі звичайного паперу і укласти їх у змащену форму хрест на хрест - так, щоб їх краї виходили за кришку мультиварки. 6. У форму мультиварки викласти подрібнене печиво з вершковим маслом і щільно утрамбувати (я це роблю за допомогою дна склянки), сформувати бортики по 2-3 см. 7. Викласти зверху підготовлену начинку. 8. Кришку мульіваркі закрити і включити режим «випічка». Час випічки приблизно 50 хвилин. 9. По закінченні часу мультиварку не відкривати відразу, а залишити на 15-20 хвилин на режимі «підігрів». Після чого кришку відкрити і дати чізкейку охолонути у формі. 10. Дістати чізкейк з форми, тримаючи за смужки і перекласти на блюдо. Накрити і помістити в холодильник на кілька годин до застигання. Готовий чізкейк при подачі прикрашайте тертим шоколадом або фруктами, можна також полити сиропом або варенням. Смачного!",
        'img' => "/img/140.webp",
        'author' => "Гордон Рамзі",
        'category' => "Третє",
        'views' => 100000
    ),
    array(
        'id' => 2,
        'title' => "Борщ",
        'ingredients' => "3 л води 300 - 400 г м'яса (свинина або яловичина, або свинячі реберця) або птиці 2-3 середніх картоплини 150 г капусти 150 г буряка 100 г моркви 2 середні цибулини 750 мл томатного соку (або 2 ст. л. томатної пасти розвести водою) 2 лаврові листки Сіль і перець рослинна олія",
        'content' => "1. М'ясо промити, нарізати шматочками, залити холодною водою і варити 2-2,5 години, якщо це свинина або яловичина. Якщо птиця, то варити за часом менше - 1-1,5 години. 2. Поки бульйон звариться, зробимо заправку для борщу. Для цього буряк окремо припустити, цибулю з морквою - окремо протушкувати. Цибулю дрібно нарізати, моркву натерти. На розігріту сковороду налити рослинного масла або покласти шматочок жиру, висипати цибулю і моркву, трохи обсмажити. Потім додати до овочів томатний сік або морс, або розвести томатну пасту водою. Тушкувати на невеликому вогні 15- 20 хвилин 3. Буряк нарізати соломкою або брусочками. Для економії часу можна і натерти на тертку, але правильно буде саме нарізати. Висипати на розігріту сковороду з рослинним маслом, трохи обсмажити. Потім додати невелику кількість води і припустити (протушкувати) 20 хвилин. І тут один момент: якщо хочете, щоб буряк не втратила свій колір в процесі, додайте трохи оцту. Але оцет можна і не додавати - тоді колір борщу виходить більш насиченим. 4. Почистити картоплю і нарізати кубиками або брусочками. 5. Коли бульйон буде готовий - закладаємо в нього картоплю. Час варіння залежить від розміру нарізаної картоплі і від його сорту, в середньому 15 хвилин. 6. Капусту нашаткувати соломкою і, коли картопля майже зварилася, закладаємо в бульйон. Проварити 3-4 хвилини. 7. Після чого висипаємо нашу заправку - протушені цибулю з морквою і томатом, а також буряк в бульйон з овочами. Посолити, поперчити. Додати лавровий лист, можна додати зелень. І вимкнути. Дати трохи настоятися.",
        'img' => "/img/8.webp",
        'author' => "Поль Бокюз",
        'category' => "Перше",
        'views' => 12345
    ),
    array(
        'id' => 3,
        'title' => "Картопля по-селянськи",
        'ingredients' => "Картопля Сіль за смаком Спеції за смаком Рослинна олія (оливкова або соняшникова)",
        'content' => "1. Картоплю почистити, промити і просушити паперовими рушниками або звичайним рушником. 2. Нарізати великими шматочками однакового розміру. 3. Скласти в форму для запікання, у мене скляна форма. Або викласти на деко, якщо плануєте запікати картоплю по-селянськи на велику компанію. 4. Посипати сіллю і спеціями, мені дуже подобається використовувати для запікання картоплі паприку, хмелі-сунелі і сушений часник. Якщо ви любите інші приправи і спеції, експериментуйте і використовуйте їх. Можна також використовувати спеціальну приправу \"Для картоплі\". 5. Полити оливковою олією. Якщо не любите оливкову, використовуйте соняшникову. Добре перемішати руками картоплю зі спеціями та олією. 6. Відправити в розігріту до 220 градусів духовку приблизно на 30 хвилин і запікати до готовності. Кришкою накривати не потрібно. Запікати в режимі без використання конвекції, у мене режим \"верх-низ\". За 10 хвилин до готовності можна зменшити температуру до 190-200 градусів і включити конвекцію, щоб картопля вийшла з апетитною золотистою скоринкою зверху. Вимкнути і залишити в духовці ще на деякий час, щоб страва \"дійшла\". Подавайте картоплю по-селянськи з нарізаною зеленню, овочевими салатами або як гарнір до інших страв. Смачного!",
        'img' => "/img/380.webp",
        'author' => "Джеймі Олівер",
        'category' => "Друге",
        'views' => 134000
    )
);

$authors = array(
    array(
        'id' => 1,
        'name' => "Гордон Рамзі"
    ),
    array(
        'id' => 2,
        'name' => "Джейми Оливер"
    ),
    array(
        'id' => 3,
        'name' => "Поль Бокюз"
    )
);
$categories = array(
    array(
        'id' => 1,
        'name' => "Перше"
    ),
    array(
        'id' => 2,
        'name' => "Друге"
    ),
    array(
        'id' => 3,
        'name' => "Третє"
    )
);